turgu1/esp32-scheme-vm/src/interpreter.c
#include "esp32-scheme-vm.h"
#include "vm-arch.h"
#include "mm.h"

#define INTERPRETER 1
#include "interpreter.h"

#define NEXT_BYTE *pc++
#define NEXT_SHORT ((uint16_t) *(uint16_t *)pc++); pc += 2
#define NEXT_SHORT_NOINC ((uint16_t) *(uint16_t *)pc++)

cell_p pop()
{
  // all the cons linking stack elements together are from the RAM Heap.
  #if DEBUGGING
    if ((env != NIL) && (ram_heap[env].type != CONS_TYPE)) {
      FATAL("HEAP BROKEN!!!");
    }
  #endif

  if (env == NIL) {
    #if DEBUGGING
      WARNING("Environment exhausted on pop()\n");
    #endif

    return NIL;
  }
  cell_p p = RAM_GET_CAR_NO_TEST(env);
  env = RAM_GET_CDR_NO_TEST(env);

  return p;
}

cell_p pop_closure(code_p *entry)
{
  cell_p tmp = pop();
  if (IN_RAM(tmp)) {
    if (IS_CLOSURE(tmp)) {
      *entry = RAM_GET_CLOSURE_ENTRY_POINT(tmp);
    }
    else {
      FATAL("Expected closure cell at %d.\n", tmp);
    }
  }
  else {
    FATAL("Closure on TOS not in RAM: %d.\n", tmp);
  }
  return tmp;
}

unit8_t prepare_arguments(int8_t nbr_args, code_p *entry)
{
  uint8_t nbr_params = *(program + *entry++);

  if (reg1 != NIL) {
    // reg1 is the closure definitions
    reg1 = RAM_GET_CLOSURE_ENV(reg1); // retrieve the environment
  }

  if ()
}

void interpreter()
{
  code_p entry;

  reg1 =
  reg2 =
  reg3 =
  reg4 =
  cont =
  env  = NIL;

  pc =  + ((*(program + 2) * sizeof(cell)));

  for (;;) {
    uint8_t instr = NEXT_BYTE;

    switch (instr & 0xF0) {
      case LDCS1 :
      case LDCS2 :
        reg1 = instr & 0x1F;
        TRACE("  LDCS %d\n", reg1);
        if (reg1 < 29)
          env = cons(reg1 |= 0xFE00, env);
        else
          env = cons(reg1 |= 0xFF70, env);
        reg1 = NIL;
        break;

      case LDSTK1 :
      case LDSTK2 :
        uint8_t cnt = instr & 0x1F;
        TRACE("  LDSTK %d\n", cnt);

        reg1 = env;
        while (cnt-- && (reg1 != NIL)) {
          reg1 = RAM_GET_CDR(reg1);
        }
        env = cons(reg1 == NIL ? NIL : RAM_GET_CAR(reg1), env);
        reg1 = NIL;
        break;

      case LDS :
        cell_p p = instr & 0x0F;
        TRACE("  LDS %d\n", p);
        reg1 = GLOBAL_GET(p);
        env = cons(reg1, env);
        reg1 = NIL;
        break;

      case STS :
        cell_p p = instr & 0x0F;
        TRACE("  STS %d\n", p);
        GLOBAL_SET(p, pop());
        break;

      case CALLC :  // Call with closure on TOS
        uint8_t n = instr & 0x0F;
        TRACE("  CALLC %d\n", n);
        reg1 = pop_closure(&entry);
        build_environment(prepare_arguments(n, &entry));
        save_cont();

        pc = program + entry;
        reg1 = NIL;
        break;

      case JUMPC :
        uint8_t n = instr & 0x0F;
        TRACE("  JUMPC %d\n", n);
        reg1 = pop_closure(&entry);
        build_environment(prepare_arguments(n, &entry));

        pc = program + entry;
        reg1 = NIL;
        break;

      case JUMPS :
        TRACE("  JUMPS\n");
        break;

      case BRSF :
        TRACE("  BRSF %d\n", instr & 0x0F);
        if (pop() == FALSE) {
          pc += (instr & 0x0F);
        }
        break;

      case LDC :
        reg1 = ((instr & 1) << 8) + NEXT_BYTE;
        TRACE("  LDC %d\n", reg1);
        env = cons(reg1 | 0xFE00, env);
        reg1 = NIL;
        break;

      case CALL:
        switch (instr) {
          case CALL :
            TRACE("  CALL\n");
            break;

          case JUMP :
            TRACE("  JUMP\n");
            break;

          case BR :
            uint16_t addr = NEXT_SHORT;
            TRACE("  BR %d\n", addr);
            pc = addr + program;
            break;

          case BRF :
            uint16_t addr = NEXT_SHORT;
            TRACE("  BRF %d\n", addr);
            if (pop() == FALSE) {
              pc = addr + program;
            }
            break;

          case CLOS :
            TRACE("  CLOS\n");
            break;

          case CALLR :
            TRACE("  CALLR\n");
            break;

          case JUMPR :
            TRACE("  JUMPR\n");
            break;

          case BRR :
            int16_t i = NEXT_BYTE;
            TRACE("  BRR %d\n", addr);
            pc += (i - 128);
            break;

          case BRRF :
            int16_t i = NEXT_BYTE;
            TRACE("  BRRF %d\n", addr);
            if (pop() == FALSE) {
              pc += (i - 128);
            }
            break;

          case CLOSR :
            TRACE("  CLOSR\n");
            break;

          case LD  :
            cell_p p = NEXT_BYTE;
            TRACE("  LD %d\n", p);
            reg1 = GLOBAL_GET(p);
            env = cons(reg1, env);
            reg1 = NIL;
            break;

          case ST :
            cell_p p = NEXT_BYTE;
            TRACE("  ST %d\n", p);
            GLOBAL_SET(p, pop());
            break;
        }
        break;
    }
  }
}
